indexxue/TM4C123GH6PM/Common/src/proto.c
/**
 * @file    proto.c
 * @brief   蓝牙协议（BOARD_UART_BT）：帧解析、HELLO/PING、遥测、参数读写、遥控
 */

#include "proto.h"

#include "attitude.h"
#include "battery.h"
#include "board.h"
#include "camera_spi.h"
#include "chassis.h"
#include "cfg.h"
#include "device_profile.h"
#include "line_follow.h"
#include "log.h"
#include "nvs.h"
#include "led_scene.h"
#include "ultrasonic.h"

#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"
#include "task.h"

#include "driverlib/uart.h"
#include "inc/hw_memmap.h"

#include <string.h>

/* -------------------------------------------------------------------------- */
/* 协议常量                                                                   */
/* -------------------------------------------------------------------------- */

#define PROTO_SOF0                  0x54U
#define PROTO_SOF1                  0x4DU
#define PROTO_VER                   0x02U
#define PROTO_HEADER_SIZE           7U
#define PROTO_MAX_PAYLOAD           256U
#define PROTO_RESPONSE_BIT          0x8000U

#define PROTO_FLAG_DIR_DEVICE       0x01U
#define PROTO_FLAG_NAK              0x02U
#define PROTO_FLAG_UNSOLICITED      0x04U

#define PROTO_CMD_HELLO             0x0001U
#define PROTO_CMD_PING              0x0002U
#define PROTO_CMD_GET_TELEMETRY     0x0010U
#define PROTO_CMD_SUBSCRIBE         0x0011U
#define PROTO_CMD_UNSUBSCRIBE       0x0012U
#define PROTO_CMD_TELEMETRY_PUSH    0x8011U
#define PROTO_CMD_PARAM_LIST        0x0020U
#define PROTO_CMD_PARAM_READ        0x0021U
#define PROTO_CMD_PARAM_WRITE       0x0022U
#define PROTO_CMD_DRIVE             0x0030U
#define PROTO_CMD_DRIVE_STOP        0x0031U
#define PROTO_CMD_SET_SPEED         0x0032U
#define PROTO_CMD_SPEED_STOP        0x0033U
#define PROTO_CMD_SET_ANGLE         0x0034U
#define PROTO_CMD_ANGLE_STOP        0x0035U
#define PROTO_CMD_CALIB_YAW         0x0036U
#define PROTO_CMD_SET_DISTANCE      0x0037U
#define PROTO_CMD_DISTANCE_STOP     0x0038U
#define PROTO_CMD_SET_LINE_FOLLOW   0x0039U
#define PROTO_CMD_LINE_FOLLOW_STOP  0x003AU
#define PROTO_CMD_CAM_SERVO_CENTER  0x0040U
#define PROTO_CMD_CAM_SERVO_SET_ANGLE 0x0041U
#define PROTO_CMD_CAM_SERVO_NUDGE   0x0042U
#define PROTO_CMD_CAM_DETECT_ENABLE 0x0043U
#define PROTO_CMD_GET_CAM_SNAPSHOT  0x0044U
#define PROTO_CMD_GET_CAM_NET       0x0045U

#define PROTO_ERR_UNKNOWN_CMD       0x02U
#define PROTO_ERR_BAD_LEN           0x03U
#define PROTO_ERR_PARAM_ID_INVALID  0x04U
#define PROTO_ERR_PARAM_READ_ONLY   0x05U
#define PROTO_ERR_PARAM_VALUE_INVALID 0x06U
#define PROTO_ERR_NVS_WRITE_FAIL    0x07U
#define PROTO_ERR_BUSY              0x08U
#define PROTO_ERR_UNSUPPORTED       0x09U

#define PROTO_CAP_TELEMETRY         (1U << 0)
#define PROTO_CAP_PARAM_RW          (1U << 1)
#define PROTO_CAP_SUBSCRIBE         (1U << 2)
#define PROTO_CAP_DRIVE             (1U << 3)
#define PROTO_CAP_SPEED_LOOP        (1U << 4)
#define PROTO_CAP_ANGLE_LOOP        (1U << 5)
#define PROTO_CAP_YAW_CALIB         (1U << 6)
#define PROTO_CAP_DISTANCE_LOOP     (1U << 7)
#define PROTO_CAP_LINE_FOLLOW       (1U << 8)
#define PROTO_CAP_CAMERA            (1U << 9)

#define PROTO_CH_BATTERY            (1U << 0)
#define PROTO_CH_ATTITUDE           (1U << 1)
#define PROTO_CH_ENCODER            (1U << 2)
#define PROTO_CH_LINE_ADC           (1U << 3)
#define PROTO_CH_ULTRASONIC         (1U << 4)
#define PROTO_CH_MOTOR_RPM          (1U << 5)
#define PROTO_CH_ANGLE_LOOP         (1U << 6)
#define PROTO_CH_DISTANCE_LOOP      (1U << 7)
#define PROTO_CH_LINE_LOOP          (1U << 8)
#define PROTO_CH_CAM_DETECT         (1U << 9)
#define PROTO_CH_CAM_SERVO          (1U << 10)

#define PROTO_BASE_MASK             (PROTO_CH_ATTITUDE | PROTO_CH_ENCODER)
#define PROTO_OPTIONAL_MASK         (PROTO_CH_BATTERY | PROTO_CH_LINE_ADC | PROTO_CH_ULTRASONIC | \
                                     PROTO_CH_MOTOR_RPM | PROTO_CH_ANGLE_LOOP | PROTO_CH_DISTANCE_LOOP | \
                                     PROTO_CH_LINE_LOOP | PROTO_CH_CAM_DETECT | PROTO_CH_CAM_SERVO)

#define PROTO_PUSH_CH_BATTERY       0U
#define PROTO_PUSH_CH_ATTITUDE      1U
#define PROTO_PUSH_CH_ENCODER       2U
#define PROTO_PUSH_CH_LINE_ADC      3U
#define PROTO_PUSH_CH_ULTRASONIC    4U
#define PROTO_PUSH_CH_MOTOR_RPM     5U
#define PROTO_PUSH_CH_ANGLE_LOOP    6U
#define PROTO_PUSH_CH_DISTANCE_LOOP 7U
#define PROTO_PUSH_CH_LINE_LOOP     8U
#define PROTO_PUSH_CH_CAM_DETECT    9U
#define PROTO_PUSH_CH_CAM_SERVO     10U

#define PROTO_DEFAULT_HZ_ATT        10U
#define PROTO_DEFAULT_HZ_ENC        5U
#define PROTO_DEFAULT_HZ_BATT       1U
#define PROTO_DEFAULT_HZ_LINE         5U
#define PROTO_DEFAULT_HZ_ULTRA      5U
#define PROTO_DEFAULT_HZ_MOTOR_RPM  10U
#define PROTO_DEFAULT_HZ_ANGLE_LOOP 10U
#define PROTO_DEFAULT_HZ_DISTANCE_LOOP 10U
#define PROTO_DEFAULT_HZ_LINE_LOOP  10U
#define PROTO_DEFAULT_HZ_CAM_DETECT 10U
#define PROTO_DEFAULT_HZ_CAM_SERVO  10U
#define PROTO_PUSH_SUPPRESS_MS      280U
#define PROTO_PUSH_SUPPRESS_SET_SPEED_FMT0_MS  350U
#define PROTO_PUSH_SUPPRESS_SET_SPEED_FMT_LR_MS 350U
#define PROTO_PUSH_SUPPRESS_SET_ANGLE_MS       60U
#define PROTO_PUSH_SUPPRESS_SET_DISTANCE_MS    350U

/** 与 app.c APP_CTRL_PERIOD_MS 一致，SET_SPEED 后立即 tick 用 */
#define PROTO_CHASSIS_TICK_MS       20U

/** 超声波未连接/未就绪/测距失败时的占位距离（mm） */
#define PROTO_ULTRA_INVALID_MM      9999U

#define PROTO_DRIVE_TIMEOUT_MS      500U
#define PROTO_DRIVE_THROTTLE_MAX    1000
#define PROTO_DRIVE_STEER_MAX       1000

/** 无主机命令视为掉线；自动重连间隔与次数 */
#define PROTO_LINK_LOST_MS          4000U
#define PROTO_RECONNECT_PERIOD_MS   2000U
#define PROTO_RECONNECT_MAX         5U

#define PROTO_TASK_NAME_RX          "proto_rx"
#define PROTO_RX_STACK_WORDS        (768U)
#define PROTO_RX_PRIORITY           (4U)
#define PROTO_RX_POLL_MS            (1U)
/** 收字节后短暂避让 TX；过长会导致遥控流式 DRIVE 期间回包饿死 */
#define PROTO_RX_GATE_MS            (8U)
#define PROTO_RX_GATE_CMD_MS        (40U)
/** TX 等待 RX 空闲的上限，超时仍发送（半双工保活优先） */
#define PROTO_TX_RX_WAIT_MAX_MS     (5U)
/** 链路保活：姿态推送最低频率（不受 host_rx_active 阻塞） */
#define PROTO_KEEPALIVE_ATT_MS      (500U)
/** 流式 DRIVE 合并 ACK 间隔（兼容上位机，避免每帧应答） */
#define PROTO_DRIVE_ACK_PERIOD_MS   (200U)

#define PROTO_TASK_NAME_TX          "proto_tx"
#define PROTO_TX_STACK_WORDS        (512U)
#define PROTO_TX_PRIORITY           (2U)
#define PROTO_TX_QUEUE_LEN          (16U)
#define PROTO_TX_MAX_FRAME          (2U + PROTO_HEADER_SIZE + PROTO_MAX_PAYLOAD + 2U)

/* 协议固定 6 路（与 NVS line_threshold[] / 两车型 ADC 一致）；板级不足时 Line_Sample 填 0 */
#define PROTO_LINE_ADC_COUNT        NVS_CFG_LINE_SENSOR_COUNT
#define PROTO_ENCODER_COUNT         4U

