indexxue/TM4C123GH6PM/Common/src/proto.c
    for (;;) {
        if (xQueueReceive(s_tx_queue, &item, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        /*
         * 短暂避让 RX，避免与半帧交错；超时仍发送。
         * 旧逻辑无限等待 host_rx_active，流式 DRIVE 时回包会被饿死。
         */
        wait_ms = 0U;
        while (proto_host_rx_active() && (wait_ms < PROTO_TX_RX_WAIT_MAX_MS)) {
            vTaskDelay(pdMS_TO_TICKS(1U));
            wait_ms++;
        }
        if (!proto_tx_lock()) {
            continue;
        }
        proto_uart_write_locked(item.bytes, item.len);
        proto_tx_unlock();
    }
}

static bool_t proto_uart_rx_pending(void)
{
    return UARTCharsAvail(BOARD_UART_BT_CFG.base) ? TRUE : FALSE;
}

static void proto_rx_gate_hold(void)
{
    s_rx_gate_until_ms = proto_uptime_ms() + PROTO_RX_GATE_MS;
}

static void proto_rx_gate_hold_cmd(void)
{
    s_rx_gate_until_ms = proto_uptime_ms() + PROTO_RX_GATE_CMD_MS;
}

static bool_t proto_push_blocked(void)
{
    /* 仅抑制参数写等事务窗口；不再因 host_rx_active 永久挡遥测 */
    if (proto_uptime_ms() < s_push_suppress_until_ms) {
        return TRUE;
    }
    return FALSE;
}

static bool_t proto_push_soft_blocked(void)
{
    /* 完整遥测通道：RX 忙时暂缓，避免与半帧强行交错 */
    if (proto_push_blocked()) {
        return TRUE;
    }
    if (proto_host_rx_active()) {
        return TRUE;
    }
    return FALSE;
}

static void proto_suppress_pushes(uint32_t ms)
{
    s_push_suppress_until_ms = proto_uptime_ms() + ms;
}

static void proto_link_note_host_rx(void)
{
    uint32_t now = proto_uptime_ms();

    s_last_host_rx_ms = (now == 0U) ? 1U : now;
    if (s_host_linked == FALSE) {
        s_host_linked = TRUE;
        LOG_INFO("proto: host link UP");
    }
    s_reconnect_attempts = 0U;
    s_reconnect_wait_ms = 0U;
    s_reconnect_budget_logged = FALSE;
}

static void proto_uart_rx_drain(void)
{
    char ch;

    while (UART_Getc(&ch) != 0) {
    }
}

static void proto_parse_reset_idle(void)
{
    s_parser.state = PROTO_PARSE_SOF0;
    s_parser.body_len = 0U;
    s_rx_gate_until_ms = 0U;
}

static void proto_link_send_announce(void)
{
    uint8_t payload[4];

    /* 无请求宣告：让遥控器 UART 收到字节 → link UP，并提示本机仍在线 */
    proto_put_u32(payload, proto_uptime_ms());
    (void)proto_uart_send_frame((uint16_t)(PROTO_CMD_PING | PROTO_RESPONSE_BIT), 0U,
                                payload, (uint16_t)sizeof(payload),
                                PROTO_FLAG_UNSOLICITED, FALSE, TRUE);
}

static void proto_link_recover_do(const char *reason)
{
    LOG_INFO("proto: link recover (%s) attempt=%u/%u",
             (reason != NULL) ? reason : "auto",
             (unsigned)(s_reconnect_attempts + 1U),
             (unsigned)PROTO_RECONNECT_MAX);

    proto_drive_stop_internal();
    s_push_suppress_until_ms = 0U;
    proto_parse_reset_idle();
    proto_uart_rx_drain();
    proto_link_send_announce();
    /* 强制推一帧姿态，帮助对端保活 */
    if (s_base.active != FALSE) {
        proto_push_attitude();
    }
}

static bool_t proto_host_rx_active(void)
{
    if (s_parser.state != PROTO_PARSE_SOF0) {
        return TRUE;
    }
    if (proto_uart_rx_pending()) {
        return TRUE;
    }
    if (proto_uptime_ms() < s_rx_gate_until_ms) {
        return TRUE;
    }
    return FALSE;
}

static bool_t proto_build_frame(uint8_t *frame, uint16_t *total_out, uint16_t cmd, uint8_t seq,
                                const uint8_t *payload, uint16_t len, uint8_t extra_flags)
{
    uint8_t *body;
    uint16_t crc;
    uint16_t total;
    uint8_t flags = (uint8_t)(PROTO_FLAG_DIR_DEVICE | extra_flags);

    if ((frame == NULL) || (total_out == NULL) || (len > PROTO_MAX_PAYLOAD)) {
        return FALSE;
    }

    frame[0] = PROTO_SOF0;
    frame[1] = PROTO_SOF1;
    body = &frame[2];
    body[0] = PROTO_VER;
    body[1] = flags;
    proto_put_u16(&body[2], len);
    proto_put_u16(&body[4], cmd);
    body[6] = seq;
    if ((len > 0U) && (payload != NULL)) {
        (void)memcpy(&body[7], payload, len);
    }

    crc = proto_crc16_ccitt_false(body, (uint16_t)(PROTO_HEADER_SIZE + len));
    proto_put_u16(&body[7 + len], crc);
    total = (uint16_t)(2U + PROTO_HEADER_SIZE + len + 2U);
    *total_out = total;
    return TRUE;
}

static bool_t proto_enqueue_frame_bytes(const uint8_t *frame, uint16_t len, bool_t to_front)
{
    proto_tx_item_t item;
    BaseType_t ok;

    if ((frame == NULL) || (len == 0U) || (len > PROTO_TX_MAX_FRAME) || (s_tx_queue == NULL)) {
        return FALSE;
    }

    item.len = len;
    (void)memcpy(item.bytes, frame, len);
    if (to_front) {
        ok = xQueueSendToFront(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    } else {
        ok = xQueueSend(s_tx_queue, &item, pdMS_TO_TICKS(20U));
    }
    if (ok != pdTRUE) {
        LOG_WARN("proto: tx queue full drop %uB", (unsigned)len);
        return FALSE;
    }
    return TRUE;
}

static bool_t proto_uart_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                                    uint8_t extra_flags, bool_t immediate, bool_t queue_front)
{
    uint8_t frame[PROTO_TX_MAX_FRAME];
    uint16_t total;

    if (!proto_build_frame(frame, &total, cmd, seq, payload, len, extra_flags)) {
        return FALSE;
    }

    if (immediate) {
        if (!proto_tx_lock()) {
            return FALSE;
        }
        proto_uart_write_locked(frame, total);
        proto_tx_unlock();
        return TRUE;
    }

    return proto_enqueue_frame_bytes(frame, total, queue_front);
}

static bool_t proto_send_frame(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len,
                               uint8_t extra_flags)
{
    return proto_uart_send_frame(cmd, seq, payload, len, extra_flags, FALSE, FALSE);
}

static void proto_reply_ack(uint16_t cmd, uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, TRUE, FALSE)) {
        LOG_WARN("proto: reply ack immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, payload, len, 0U, FALSE, TRUE);
    }
}

