indexxue/TM4C123GH6PM/Common/src/proto.c
static void proto_reply_nak(uint16_t cmd, uint8_t seq, uint8_t err_code)
{
    uint16_t rsp_cmd = (uint16_t)(cmd | PROTO_RESPONSE_BIT);

    if (!proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, TRUE, FALSE)) {
        LOG_WARN("proto: reply nak immediate fail cmd=0x%04x seq=%u", (unsigned)cmd, (unsigned)seq);
        (void)proto_uart_send_frame(rsp_cmd, seq, &err_code, 1U, PROTO_FLAG_NAK, FALSE, TRUE);
    }
}

static void proto_push_frame(const uint8_t *payload, uint16_t len)
{
    proto_send_frame(PROTO_CMD_TELEMETRY_PUSH, 0U, payload, len, PROTO_FLAG_UNSOLICITED);
}

/* -------------------------------------------------------------------------- */
/* 参数写入适配                                                               */
/* -------------------------------------------------------------------------- */

static status_t proto_write_fw_version(const uint8_t *data, uint16_t len)
{
    char ver[NVS_CFG_FW_VER_MAX];

    if ((data == NULL) || (len == 0U) || (len >= NVS_CFG_FW_VER_MAX)) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(ver, data, len);
    ver[len] = '\0';
    return nvs_param_set_fw_version(ver, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_pid_speed(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_speed(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_line(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_line(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_line_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_yaw(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_yaw(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_angle_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_pid_dist(const uint8_t *data, uint16_t len)
{
    nvs_pid3_t pid;

    if ((data == NULL) || (len != sizeof(nvs_pid3_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&pid, data, sizeof(pid));
    if (nvs_param_set_pid_dist(&pid, NVS_WRITE_SRC_PROTOCOL) == STATUS_OK) {
        chassis_reload_distance_pid_gains();
        return STATUS_OK;
    }
    return STATUS_FAIL;
}

static status_t proto_write_spd_limit(const uint8_t *data, uint16_t len)
{
    nvs_spd_limit_t limit;

    if ((data == NULL) || (len != sizeof(nvs_spd_limit_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&limit, data, sizeof(limit));
    return nvs_param_set_spd_limit(&limit, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_kinematics(const uint8_t *data, uint16_t len)
{
    nvs_kinematics_t kinem;

    if ((data == NULL) || (len != sizeof(nvs_kinematics_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&kinem, data, sizeof(kinem));
    return nvs_param_set_kinematics(&kinem, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_motor_dir(const uint8_t *data, uint16_t len)
{
    u32_t mask;

    if ((data == NULL) || (len != sizeof(u32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&mask, data, sizeof(mask));
    return nvs_param_set_motor_dir_mask(mask, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_encoder_dir(const uint8_t *data, uint16_t len)
{
    u32_t mask;

    if ((data == NULL) || (len != sizeof(u32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&mask, data, sizeof(mask));
    return nvs_param_set_encoder_dir_mask(mask, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_imu_offset(const uint8_t *data, uint16_t len)
{
    nvs_imu_offset_t offset;

    if ((data == NULL) || (len != sizeof(nvs_imu_offset_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&offset, data, sizeof(offset));
    return nvs_param_set_imu_offset(&offset, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_line_threshold(const uint8_t *data, uint16_t len)
{
    nvs_line_threshold_t threshold;

    if ((data == NULL) || (len != sizeof(nvs_line_threshold_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&threshold, data, sizeof(threshold));
    return nvs_param_set_line_threshold(&threshold, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_line_polarity(const uint8_t *data, uint16_t len)
{
    u8_t pol;

    if ((data == NULL) || (len != sizeof(u8_t))) {
        return STATUS_INVALID_ARG;
    }
    pol = data[0];
    if (pol > 1U) {
        return STATUS_INVALID_ARG;
    }
    return nvs_param_set_line_polarity(pol, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_line_base_rpm(const uint8_t *data, uint16_t len)
{
    f32_t rpm;

    if ((data == NULL) || (len != sizeof(f32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&rpm, data, sizeof(rpm));
    return nvs_param_set_line_base_rpm(rpm, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_encoder_zero(const uint8_t *data, uint16_t len)
{
    nvs_encoder_zero_t zero;

    if ((data == NULL) || (len != sizeof(nvs_encoder_zero_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&zero, data, sizeof(zero));
    return nvs_param_set_encoder_zero(&zero, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_battery_cal(const uint8_t *data, uint16_t len)
{
    nvs_battery_cal_t cal;

    if ((data == NULL) || (len != sizeof(nvs_battery_cal_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&cal, data, sizeof(cal));
    return nvs_param_set_battery_cal(&cal, NVS_WRITE_SRC_PROTOCOL);
}

static status_t proto_write_mag_heading(const uint8_t *data, uint16_t len)
{
    f32_t offset;
    status_t st;

    if ((data == NULL) || (len != sizeof(f32_t))) {
        return STATUS_INVALID_ARG;
    }
    (void)memcpy(&offset, data, sizeof(offset));
    st = nvs_param_set_mag_heading_offset(offset, NVS_WRITE_SRC_PROTOCOL);
    if (st == STATUS_OK) {
        attitude_set_mag_heading_offset((float)offset);
    }
    return st;
}

