indexxue/TM4C123GH6PM/Common/src/proto.c
static const proto_param_desc_t s_param_table[] = {
    { NVS_PARAM_SCHEMA,         (uint8_t)sizeof(u32_t),              NULL },
    { NVS_PARAM_SERIAL,       NVS_CFG_SERIAL_MAX,                  NULL },
    { NVS_PARAM_HW_REV,       (uint8_t)sizeof(u32_t),              NULL },
    { NVS_PARAM_BOOT_COUNT,   (uint8_t)sizeof(u32_t),              NULL },
    { NVS_PARAM_FW_VERSION,   NVS_CFG_FW_VER_MAX,                  proto_write_fw_version },
    { NVS_PARAM_PID_SPEED,    (uint8_t)sizeof(nvs_pid3_t),         proto_write_pid_speed },
    { NVS_PARAM_PID_LINE,     (uint8_t)sizeof(nvs_pid3_t),         proto_write_pid_line },
    { NVS_PARAM_PID_YAW,      (uint8_t)sizeof(nvs_pid3_t),         proto_write_pid_yaw },
    { NVS_PARAM_PID_DIST,     (uint8_t)sizeof(nvs_pid3_t),         proto_write_pid_dist },
    { NVS_PARAM_SPD_LIMIT,    (uint8_t)sizeof(nvs_spd_limit_t),    proto_write_spd_limit },
    { NVS_PARAM_KINEMATICS,   (uint8_t)sizeof(nvs_kinematics_t),  proto_write_kinematics },
    { NVS_PARAM_MOTOR_DIR,    (uint8_t)sizeof(u32_t),              proto_write_motor_dir },
    { NVS_PARAM_ENCODER_DIR,  (uint8_t)sizeof(u32_t),              proto_write_encoder_dir },
    { NVS_PARAM_IMU_OFFSET,   (uint8_t)sizeof(nvs_imu_offset_t),   proto_write_imu_offset },
    { NVS_PARAM_LINE_THRESHOLD, (uint8_t)sizeof(nvs_line_threshold_t), proto_write_line_threshold },
    { NVS_PARAM_LINE_POLARITY, (uint8_t)sizeof(u8_t),                 proto_write_line_polarity },
    { NVS_PARAM_LINE_BASE_RPM, (uint8_t)sizeof(f32_t),                proto_write_line_base_rpm },
    { NVS_PARAM_ENCODER_ZERO, (uint8_t)sizeof(nvs_encoder_zero_t), proto_write_encoder_zero },
    { NVS_PARAM_BATTERY_CAL,  (uint8_t)sizeof(nvs_battery_cal_t), proto_write_battery_cal },
    { NVS_PARAM_MAG_HEADING,  (uint8_t)sizeof(f32_t),             proto_write_mag_heading },
    { NVS_PARAM_LAST_MODE,    (uint8_t)sizeof(u32_t),              NULL },
};

#define PROTO_PARAM_TABLE_COUNT ((uint16_t)(sizeof(s_param_table) / sizeof(s_param_table[0])))

static const proto_param_desc_t *proto_param_lookup(nvs_param_id_t id)
{
    uint16_t i;

    for (i = 0U; i < PROTO_PARAM_TABLE_COUNT; i++) {
        if (s_param_table[i].id == id) {
            return &s_param_table[i];
        }
    }
    return NULL;
}

static uint16_t proto_param_read_blob(nvs_param_id_t id, uint8_t *out, uint16_t out_max)
{
    const nvs_cfg_t *cfg = nvs_cfg_get();
    const proto_param_desc_t *desc = proto_param_lookup(id);

    if ((cfg == NULL) || (desc == NULL) || (out == NULL) || (out_max < desc->size)) {
        return 0U;
    }

    switch (id) {
    case NVS_PARAM_SCHEMA:
        (void)memcpy(out, &cfg->schema_version, sizeof(cfg->schema_version));
        return (uint16_t)sizeof(cfg->schema_version);
    case NVS_PARAM_SERIAL:
        (void)memcpy(out, cfg->serial, desc->size);
        return desc->size;
    case NVS_PARAM_HW_REV:
        (void)memcpy(out, &cfg->hw_rev, sizeof(cfg->hw_rev));
        return (uint16_t)sizeof(cfg->hw_rev);
    case NVS_PARAM_BOOT_COUNT:
        (void)memcpy(out, &cfg->boot_count, sizeof(cfg->boot_count));
        return (uint16_t)sizeof(cfg->boot_count);
    case NVS_PARAM_FW_VERSION:
        (void)memcpy(out, cfg->fw_version, desc->size);
        return desc->size;
    case NVS_PARAM_PID_SPEED:
        (void)memcpy(out, &cfg->pid_speed, sizeof(cfg->pid_speed));
        return (uint16_t)sizeof(cfg->pid_speed);
    case NVS_PARAM_PID_LINE:
        (void)memcpy(out, &cfg->pid_line, sizeof(cfg->pid_line));
        return (uint16_t)sizeof(cfg->pid_line);
    case NVS_PARAM_PID_YAW:
        (void)memcpy(out, &cfg->pid_yaw, sizeof(cfg->pid_yaw));
        return (uint16_t)sizeof(cfg->pid_yaw);
    case NVS_PARAM_PID_DIST:
        (void)memcpy(out, &cfg->pid_dist, sizeof(cfg->pid_dist));
        return (uint16_t)sizeof(cfg->pid_dist);
    case NVS_PARAM_SPD_LIMIT:
        (void)memcpy(out, &cfg->spd_limit, sizeof(cfg->spd_limit));
        return (uint16_t)sizeof(cfg->spd_limit);
    case NVS_PARAM_KINEMATICS:
        (void)memcpy(out, &cfg->kinematics, sizeof(cfg->kinematics));
        return (uint16_t)sizeof(cfg->kinematics);
    case NVS_PARAM_MOTOR_DIR:
        (void)memcpy(out, &cfg->motor_dir_mask, sizeof(cfg->motor_dir_mask));
        return (uint16_t)sizeof(cfg->motor_dir_mask);
    case NVS_PARAM_ENCODER_DIR:
        (void)memcpy(out, &cfg->encoder_dir_mask, sizeof(cfg->encoder_dir_mask));
        return (uint16_t)sizeof(cfg->encoder_dir_mask);
    case NVS_PARAM_IMU_OFFSET:
        (void)memcpy(out, &cfg->imu_offset, sizeof(cfg->imu_offset));
        return (uint16_t)sizeof(cfg->imu_offset);
    case NVS_PARAM_LINE_THRESHOLD:
        (void)memcpy(out, &cfg->line_threshold, sizeof(cfg->line_threshold));
        return (uint16_t)sizeof(cfg->line_threshold);
    case NVS_PARAM_LINE_POLARITY:
        out[0] = cfg->line_black_active_high;
        return 1U;
    case NVS_PARAM_LINE_BASE_RPM:
        (void)memcpy(out, &cfg->line_base_rpm, sizeof(cfg->line_base_rpm));
        return (uint16_t)sizeof(cfg->line_base_rpm);
    case NVS_PARAM_ENCODER_ZERO:
        (void)memcpy(out, &cfg->encoder_zero, sizeof(cfg->encoder_zero));
        return (uint16_t)sizeof(cfg->encoder_zero);
    case NVS_PARAM_BATTERY_CAL:
        (void)memcpy(out, &cfg->battery_cal, sizeof(cfg->battery_cal));
        return (uint16_t)sizeof(cfg->battery_cal);
    case NVS_PARAM_MAG_HEADING:
        (void)memcpy(out, &cfg->mag_heading_offset_deg, sizeof(cfg->mag_heading_offset_deg));
        return (uint16_t)sizeof(cfg->mag_heading_offset_deg);
    case NVS_PARAM_LAST_MODE:
    {
        u32_t mode = (u32_t)cfg->last_mode;

        (void)memcpy(out, &mode, sizeof(mode));
        return (uint16_t)sizeof(mode);
    }
    default:
        return 0U;
    }
}

/* -------------------------------------------------------------------------- */
/* 遥测                                                                       */
/* -------------------------------------------------------------------------- */

static void proto_sample_line_adc(uint16_t *out, size_t count)
{
    size_t i;

    if ((out == NULL) || (count == 0U)) {
        return;
    }
    for (i = 0U; i < count; i++) {
        out[i] = 0U;
    }
    if (!device_profile_board_wants(DEVICE_BOARD_MASK_LINE)) {
        return;
    }
    (void)Line_Sample(out, count);
}

static uint16_t proto_sample_ultrasonic_mm(void)
{
    uint16_t mm = PROTO_ULTRA_INVALID_MM;
    status_t st;

    if (!device_profile_board_wants(DEVICE_BOARD_MASK_PERIPH)) {
        return PROTO_ULTRA_INVALID_MM;
    }

    /* PC1=Echo/SWDIO：boot 灯效结束后再 init，避免占用 SWD 影响烧录 */
    if (s_ultra_init_attempted == FALSE) {
        if (led_scene_is_active()) {
            return PROTO_ULTRA_INVALID_MM;
        }
        s_ultra_init_attempted = TRUE;
        if (ultrasonic_init() != STATUS_OK) {
            return PROTO_ULTRA_INVALID_MM;
        }
        s_ultra_ready = TRUE;
    }

