indexxue/TM4C123GH6PM/Common/src/proto.c
static void proto_push_ultrasonic(void)
{
    uint8_t payload[5U + 2U];
    uint16_t mm = proto_sample_ultrasonic_mm();

    payload[0] = PROTO_PUSH_CH_ULTRASONIC;
    proto_put_u32(&payload[1], proto_uptime_ms());
    proto_put_u16(&payload[5], mm);
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_cam_detect(void)
{
    camera_spi_detect_t det;
    uint8_t payload[5U + 1U + 1U + 1U + 2U + 2U + 16U];
    uint8_t i;

    (void)memset(&det, 0, sizeof(det));
    (void)camera_spi_get_detect(&det);

    payload[0] = PROTO_PUSH_CH_CAM_DETECT;
    proto_put_u32(&payload[1], proto_uptime_ms());
    payload[5] = (det.valid != FALSE) ? 1U : 0U;
    payload[6] = det.count;
    payload[7] = det.best_index;
    proto_put_u16(&payload[8], det.frame_w);
    proto_put_u16(&payload[10], det.frame_h);
    for (i = 0U; i < 2U; i++) {
        uint8_t *b = &payload[12U + (i * 8U)];
        proto_put_u16(&b[0], det.box[i].x);
        proto_put_u16(&b[2], det.box[i].y);
        proto_put_u16(&b[4], det.box[i].w);
        b[6] = det.box[i].score_u8;
        b[7] = det.box[i].class_id;
    }
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

static void proto_push_cam_servo(void)
{
    camera_spi_servo_t servo;
    uint8_t payload[5U + 1U + 16U];

    (void)memset(&servo, 0, sizeof(servo));
    (void)camera_spi_get_servo(&servo);

    payload[0] = PROTO_PUSH_CH_CAM_SERVO;
    proto_put_u32(&payload[1], proto_uptime_ms());
    payload[5] = (servo.valid != FALSE) ? 1U : 0U;
    proto_put_i16(&payload[6], servo.pan_deg_x100);
    proto_put_i16(&payload[8], servo.tilt_deg_x100);
    proto_put_u16(&payload[10], servo.pan_pulse_us);
    proto_put_u16(&payload[12], servo.tilt_pulse_us);
    proto_put_i16(&payload[14], servo.pan_min_x100);
    proto_put_i16(&payload[16], servo.pan_max_x100);
    proto_put_i16(&payload[18], servo.tilt_min_x100);
    proto_put_i16(&payload[20], servo.tilt_max_x100);
    proto_push_frame(payload, (uint16_t)sizeof(payload));
}

/* -------------------------------------------------------------------------- */
/* 遥控                                                                       */
/* -------------------------------------------------------------------------- */

static void proto_motor_all_stop(void)
{
    chassis_stop();
}

static void proto_apply_drive(int16_t throttle, int16_t steer)
{
    if (!device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR)) {
        return;
    }

    chassis_set_drive((int32_t)throttle, (int32_t)steer, PROTO_DRIVE_THROTTLE_MAX, PROTO_DRIVE_STEER_MAX);
}

static void proto_drive_stop_internal(void)
{
    s_drive_active = false;
    s_drive_stop_req = true;
}

/* -------------------------------------------------------------------------- */
/* 命令处理                                                                   */
/* -------------------------------------------------------------------------- */

static uint32_t proto_caps(void)
{
    uint32_t caps = PROTO_CAP_TELEMETRY | PROTO_CAP_PARAM_RW | PROTO_CAP_SUBSCRIBE;

    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR)) {
        caps |= PROTO_CAP_DRIVE;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER)) {
        caps |= PROTO_CAP_SPEED_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER |
                                   DEVICE_BOARD_MASK_PERIPH)) {
        caps |= PROTO_CAP_ANGLE_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_MOTOR | DEVICE_BOARD_MASK_ENCODER)) {
        caps |= PROTO_CAP_DISTANCE_LOOP;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_LINE | DEVICE_BOARD_MASK_MOTOR |
                                   DEVICE_BOARD_MASK_ENCODER)) {
        caps |= PROTO_CAP_LINE_FOLLOW;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_PERIPH)) {
        caps |= PROTO_CAP_YAW_CALIB;
    }
    if (device_profile_board_wants(DEVICE_BOARD_MASK_PERIPH) &&
        (camera_spi_is_ready() != FALSE)) {
        caps |= PROTO_CAP_CAMERA;
    }
    return caps;
}

static void proto_handle_hello(uint8_t seq)
{
    const nvs_cfg_t *cfg = nvs_cfg_get();
    uint8_t payload[1U + NVS_CFG_FW_VER_MAX + 8U];

    payload[0] = PROTO_VER;
    if (cfg != NULL) {
        (void)memcpy(&payload[1], cfg->fw_version, NVS_CFG_FW_VER_MAX);
        proto_put_u32(&payload[1U + NVS_CFG_FW_VER_MAX], cfg->hw_rev);
    } else {
        (void)memset(&payload[1], 0, NVS_CFG_FW_VER_MAX + 4U);
    }
    proto_put_u32(&payload[1U + NVS_CFG_FW_VER_MAX + 4U], proto_caps());
    proto_reply_ack(PROTO_CMD_HELLO, seq, payload, (uint16_t)sizeof(payload));
}

static void proto_handle_ping(uint8_t seq)
{
    uint8_t payload[4];

    proto_put_u32(payload, proto_uptime_ms());
    proto_reply_ack(PROTO_CMD_PING, seq, payload, (uint16_t)sizeof(payload));
}

static void proto_handle_get_telemetry(uint8_t seq)
{
    uint8_t payload[64];
    uint16_t len = proto_build_telemetry(payload, (uint16_t)sizeof(payload));

    if (len == 0U) {
        proto_reply_nak(PROTO_CMD_GET_TELEMETRY, seq, PROTO_ERR_BUSY);
        return;
    }
    proto_reply_ack(PROTO_CMD_GET_TELEMETRY, seq, payload, len);
}

static void proto_handle_subscribe(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint32_t mask;
    uint8_t hz_att;
    uint8_t hz_enc;
    uint8_t hz_line;
    uint8_t hz_ultra;
    uint8_t hz_motor_rpm;
    uint8_t hz_angle_loop;
    uint8_t hz_distance_loop;
    uint8_t hz_line_loop;
    uint8_t hz_cam_detect;
    uint8_t hz_cam_servo;

    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_SUBSCRIBE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    LOG_INFO("proto: subscribe req seq=%u len=%u", (unsigned)seq, (unsigned)len);

    mask = proto_get_u32(&payload[0]);
    if (len >= 8U) {
        hz_att = payload[4];
        hz_enc = payload[5];
        hz_line = payload[6];
        hz_ultra = payload[7];
    } else {
        hz_att = PROTO_DEFAULT_HZ_ATT;
        hz_enc = 0U;
        hz_line = PROTO_DEFAULT_HZ_LINE;
        hz_ultra = 0U;
    }
    if (len >= 9U) {
        hz_motor_rpm = payload[8];
    } else if ((mask & PROTO_CH_MOTOR_RPM) != 0U) {
        hz_motor_rpm = PROTO_DEFAULT_HZ_MOTOR_RPM;
    } else {
        hz_motor_rpm = 0U;
    }
    if (len >= 10U) {
        hz_angle_loop = payload[9];
    } else if ((mask & PROTO_CH_ANGLE_LOOP) != 0U) {
        hz_angle_loop = PROTO_DEFAULT_HZ_ANGLE_LOOP;
    } else {
        hz_angle_loop = 0U;
    }
    if (len >= 11U) {
        hz_distance_loop = payload[10];
    } else if ((mask & PROTO_CH_DISTANCE_LOOP) != 0U) {
        hz_distance_loop = PROTO_DEFAULT_HZ_DISTANCE_LOOP;
    } else {
        hz_distance_loop = 0U;
    }
    if (len >= 12U) {
        hz_line_loop = payload[11];
    } else if ((mask & PROTO_CH_LINE_LOOP) != 0U) {
        hz_line_loop = PROTO_DEFAULT_HZ_LINE_LOOP;
    } else {
        hz_line_loop = 0U;
    }
    if (len >= 13U) {
        hz_cam_detect = payload[12];
    } else if ((mask & PROTO_CH_CAM_DETECT) != 0U) {
        hz_cam_detect = PROTO_DEFAULT_HZ_CAM_DETECT;
    } else {
        hz_cam_detect = 0U;
    }
    if (len >= 14U) {
        hz_cam_servo = payload[13];
    } else if ((mask & PROTO_CH_CAM_SERVO) != 0U) {
        hz_cam_servo = PROTO_DEFAULT_HZ_CAM_SERVO;
    } else {
        hz_cam_servo = 0U;
    }

    /* 先 ACK 再开推送，避免与应答争用 TX 互斥/共享缓冲 */
    proto_reply_ack(PROTO_CMD_SUBSCRIBE, seq, NULL, 0U);
    LOG_INFO("proto: subscribe ack seq=%u mask=0x%08lx opt=0x%08lx",
             (unsigned)seq, (unsigned long)mask,
             (unsigned long)(mask & PROTO_OPTIONAL_MASK));

    if ((mask & PROTO_CH_ATTITUDE) != 0U) {
        s_base.hz_att = proto_effective_hz(hz_att, PROTO_DEFAULT_HZ_ATT);
    }
    if ((mask & PROTO_CH_ENCODER) != 0U) {
        s_base.hz_enc = proto_effective_hz(hz_enc, PROTO_DEFAULT_HZ_ENC);
    }
    s_base.active = TRUE;

