indexxue/TM4C123GH6PM/Common/src/proto.c
    s_sub.mask = mask & PROTO_OPTIONAL_MASK;
    if ((s_sub.mask & PROTO_CH_BATTERY) != 0U) {
        s_sub.hz_batt = PROTO_DEFAULT_HZ_BATT;
    }
    s_sub.hz_line = hz_line;
    s_sub.hz_ultra = hz_ultra;
    s_sub.hz_motor_rpm = hz_motor_rpm;
    s_sub.hz_angle_loop = hz_angle_loop;
    s_sub.hz_distance_loop = hz_distance_loop;
    s_sub.hz_line_loop = hz_line_loop;
    s_sub.hz_cam_detect = hz_cam_detect;
    s_sub.hz_cam_servo = hz_cam_servo;
    s_sub.acc_batt_ms = 0U;
    s_sub.acc_line_ms = 0U;
    s_sub.acc_ultra_ms = 0U;
    s_sub.acc_motor_rpm_ms = 0U;
    s_sub.acc_angle_loop_ms = 0U;
    s_sub.acc_distance_loop_ms = 0U;
    s_sub.acc_line_loop_ms = 0U;
    s_sub.acc_cam_detect_ms = 0U;
    s_sub.acc_cam_servo_ms = 0U;
}

static void proto_handle_unsubscribe(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint32_t mask;

    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_UNSUBSCRIBE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    mask = proto_get_u32(payload);
    if (mask == 0xFFFFFFFFU) {
        s_sub.mask = 0U;
    } else {
        s_sub.mask &= ~(mask & PROTO_OPTIONAL_MASK);
    }
    s_sub.acc_batt_ms = 0U;
    s_sub.acc_line_ms = 0U;
    s_sub.acc_ultra_ms = 0U;
    s_sub.acc_motor_rpm_ms = 0U;
    s_sub.acc_angle_loop_ms = 0U;
    s_sub.acc_distance_loop_ms = 0U;
    s_sub.acc_cam_detect_ms = 0U;
    s_sub.acc_cam_servo_ms = 0U;
    proto_reply_ack(PROTO_CMD_UNSUBSCRIBE, seq, NULL, 0U);
}

static void proto_handle_param_list(uint8_t seq)
{
    uint8_t payload[PROTO_PARAM_TABLE_COUNT * 8U];
    uint16_t off = 0U;
    uint16_t i;

    for (i = 0U; i < PROTO_PARAM_TABLE_COUNT; i++) {
        uint8_t flags = 0U;

        if (nvs_param_write_allowed(s_param_table[i].id, NVS_WRITE_SRC_PROTOCOL)) {
            flags = 1U;
        }
        proto_put_u16(&payload[off], (uint16_t)s_param_table[i].id);
        payload[off + 2U] = flags;
        payload[off + 3U] = s_param_table[i].size;
        payload[off + 4U] = 0U;
        payload[off + 5U] = 0U;
        off = (uint16_t)(off + 8U);
    }
    proto_reply_ack(PROTO_CMD_PARAM_LIST, seq, payload, off);
}

static void proto_handle_param_read(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    nvs_param_id_t id;
    uint8_t out[128];
    uint16_t out_len;

    if (len < 2U) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    id = (nvs_param_id_t)proto_get_u16(payload);
    if (proto_param_lookup(id) == NULL) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    out_len = proto_param_read_blob(id, out, (uint16_t)sizeof(out));
    if (out_len == 0U) {
        proto_reply_nak(PROTO_CMD_PARAM_READ, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    proto_reply_ack(PROTO_CMD_PARAM_READ, seq, out, out_len);
}

static void proto_handle_param_write(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    nvs_param_id_t id;
    const proto_param_desc_t *desc;
    status_t st;

    if (len < 3U) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_BAD_LEN);
        return;
    }
    id = (nvs_param_id_t)proto_get_u16(payload);
    desc = proto_param_lookup(id);
    if (desc == NULL) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_ID_INVALID);
        return;
    }
    if ((desc->write_fn == NULL) ||
        !nvs_param_write_allowed(id, NVS_WRITE_SRC_PROTOCOL)) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_READ_ONLY);
        return;
    }
    if ((uint16_t)(len - 2U) != desc->size) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    st = desc->write_fn(&payload[2], desc->size);
    if (st == STATUS_INVALID_ARG) {
        proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    if (st != STATUS_OK) {
        if (st == STATUS_NOT_SUPPORTED) {
            proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_PARAM_READ_ONLY);
        } else {
            proto_reply_nak(PROTO_CMD_PARAM_WRITE, seq, PROTO_ERR_NVS_WRITE_FAIL);
        }
        return;
    }
    proto_reply_ack(PROTO_CMD_PARAM_WRITE, seq, NULL, 0U);
}

static void proto_handle_drive(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int16_t throttle;
    int16_t steer;

    if ((proto_caps() & PROTO_CAP_DRIVE) == 0U) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 4U) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    throttle = proto_get_i16(&payload[0]);
    steer = proto_get_i16(&payload[2]);
    if ((throttle < -PROTO_DRIVE_THROTTLE_MAX) || (throttle > PROTO_DRIVE_THROTTLE_MAX) ||
        (steer < -PROTO_DRIVE_STEER_MAX) || (steer > PROTO_DRIVE_STEER_MAX)) {
        proto_reply_nak(PROTO_CMD_DRIVE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    s_drive_throttle = throttle;
    s_drive_steer = steer;
    s_drive_last_ms = proto_uptime_ms();
    s_drive_active = true;
    s_drive_stop_req = false;
    /*
     * 流式 DRIVE：合并 ACK（≤5Hz），非法仍即时 NAK。
     * 全帧 ACK 会占满半双工，导致保活推送饿死、遥控器 link timeout。
     */
    if ((s_drive_ack_last_ms == 0U) ||
        ((s_drive_last_ms - s_drive_ack_last_ms) >= PROTO_DRIVE_ACK_PERIOD_MS)) {
        s_drive_ack_last_ms = s_drive_last_ms;
        (void)proto_uart_send_frame((uint16_t)(PROTO_CMD_DRIVE | PROTO_RESPONSE_BIT), seq,
                                    NULL, 0U, 0U, FALSE, FALSE);
    }
}

static void proto_handle_drive_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_DRIVE) == 0U) {
        proto_reply_nak(PROTO_CMD_DRIVE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    proto_drive_stop_internal();
    s_drive_ack_last_ms = 0U;
    proto_reply_ack(PROTO_CMD_DRIVE_STOP, seq, NULL, 0U);
}

static void proto_handle_set_speed(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint8_t format;

    if ((proto_caps() & PROTO_CAP_SPEED_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len < 6U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        if ((payload[1] < 1U) || (payload[1] > PROTO_ENCODER_COUNT)) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_PARAM_VALUE_INVALID);
            return;
        }
        chassis_set_wheel_rpm(payload[1], proto_get_i32(&payload[2]));
        break;
    case 1U:
        if (len < 9U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        chassis_set_lr_rpm(proto_get_i32(&payload[1]), proto_get_i32(&payload[5]));
        break;
    case 2U:
        if (len < 17U) {
            proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        chassis_set_wheel_rpm(1U, proto_get_i32(&payload[1]));
        chassis_set_wheel_rpm(2U, proto_get_i32(&payload[5]));
        chassis_set_wheel_rpm(3U, proto_get_i32(&payload[9]));
        chassis_set_wheel_rpm(4U, proto_get_i32(&payload[13]));
        break;
    default:
        proto_reply_nak(PROTO_CMD_SET_SPEED, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    s_drive_active = false;
    s_drive_stop_req = false;
    if (format == 0U) {
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_SPEED_FMT0_MS);
    } else {
        proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_SPEED_FMT_LR_MS);
    }
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SET_SPEED, seq, NULL, 0U);
}

static void proto_handle_speed_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_SPEED_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SPEED_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SPEED_STOP, seq, NULL, 0U);
}

static void proto_handle_set_angle(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int16_t target_yaw;
    int32_t base_rpm;
    int32_t max_turn_rpm;

    if ((proto_caps() & PROTO_CAP_ANGLE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        if (len < 7U) {
            proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        target_yaw = proto_get_i16(&payload[1]);
        base_rpm = proto_get_i32(&payload[3]);
        max_turn_rpm = 0;
        break;
    case 1U:
        if (len < 11U) {
            proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        target_yaw = proto_get_i16(&payload[1]);
        base_rpm = proto_get_i32(&payload[3]);
        max_turn_rpm = proto_get_i32(&payload[7]);
        break;
    default:
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    if ((base_rpm > 1200) || (base_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }
    if ((max_turn_rpm > 1200) || (max_turn_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_ANGLE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_set_angle(target_yaw, base_rpm, max_turn_rpm);
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_ANGLE_MS);
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_SET_ANGLE, seq, NULL, 0U);
}

static void proto_handle_angle_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_ANGLE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_ANGLE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    chassis_tick(PROTO_CHASSIS_TICK_MS);
    proto_reply_ack(PROTO_CMD_ANGLE_STOP, seq, NULL, 0U);
}

static void proto_handle_set_distance(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    int32_t target_dist_mm;
    int32_t max_rpm;

    if ((proto_caps() & PROTO_CAP_DISTANCE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 8U) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    target_dist_mm = proto_get_i32(&payload[0]);
    max_rpm = proto_get_i32(&payload[4]);
    if ((max_rpm > 1200) || (max_rpm < -1200)) {
        proto_reply_nak(PROTO_CMD_SET_DISTANCE, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

    chassis_set_distance(target_dist_mm, max_rpm);
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_suppress_pushes(PROTO_PUSH_SUPPRESS_SET_DISTANCE_MS);
    proto_reply_ack(PROTO_CMD_SET_DISTANCE, seq, NULL, 0U);
}

static void proto_handle_distance_stop(uint8_t seq)
{
    if ((proto_caps() & PROTO_CAP_DISTANCE_LOOP) == 0U) {
        proto_reply_nak(PROTO_CMD_DISTANCE_STOP, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    chassis_stop();
    s_drive_active = false;
    s_drive_stop_req = false;
    proto_reply_ack(PROTO_CMD_DISTANCE_STOP, seq, NULL, 0U);
}

static void proto_handle_set_line_follow(uint8_t seq, const uint8_t *payload, uint16_t len)
{
    uint8_t format;
    int32_t base_rpm = 0;

    if ((proto_caps() & PROTO_CAP_LINE_FOLLOW) == 0U) {
        proto_reply_nak(PROTO_CMD_SET_LINE_FOLLOW, seq, PROTO_ERR_UNSUPPORTED);
        return;
    }
    if (len < 1U) {
        proto_reply_nak(PROTO_CMD_SET_LINE_FOLLOW, seq, PROTO_ERR_BAD_LEN);
        return;
    }

    format = payload[0];
    switch (format) {
    case 0U:
        base_rpm = 0; /* 用 NVS line_base_rpm */
        break;
    case 1U:
        if (len < 5U) {
            proto_reply_nak(PROTO_CMD_SET_LINE_FOLLOW, seq, PROTO_ERR_BAD_LEN);
            return;
        }
        base_rpm = proto_get_i32(&payload[1]);
        if ((base_rpm > 1200) || (base_rpm < 0)) {
            proto_reply_nak(PROTO_CMD_SET_LINE_FOLLOW, seq, PROTO_ERR_PARAM_VALUE_INVALID);
            return;
        }
        break;
    default:
        proto_reply_nak(PROTO_CMD_SET_LINE_FOLLOW, seq, PROTO_ERR_PARAM_VALUE_INVALID);
        return;
    }

