indexxue/TM4C123GH6PM/Common/src/proto.c
    switch (s_parser.state) {
    case PROTO_PARSE_SOF0:
        if (byte == PROTO_SOF0) {
            s_parser.state = PROTO_PARSE_SOF1;
            proto_rx_gate_hold();
        }
        break;
    case PROTO_PARSE_SOF1:
        if (byte == PROTO_SOF1) {
            s_parser.body_len = 0U;
            s_parser.state = PROTO_PARSE_BODY;
            proto_rx_gate_hold();
        } else if (byte == PROTO_SOF0) {
            s_parser.state = PROTO_PARSE_SOF1;
            proto_rx_gate_hold();
        } else {
            s_parser.state = PROTO_PARSE_SOF0;
        }
        break;
    case PROTO_PARSE_BODY:
        s_parser.body[s_parser.body_len++] = byte;
        proto_rx_gate_hold();
        if (s_parser.body_len < (PROTO_HEADER_SIZE + 2U)) {
            break;
        }
        payload_len = proto_get_u16(&s_parser.body[2]);
        if (payload_len > PROTO_MAX_PAYLOAD) {
            proto_parse_reset();
            break;
        }
        if (s_parser.body_len < (uint16_t)(PROTO_HEADER_SIZE + payload_len + 2U)) {
            break;
        }

        crc_expected = proto_get_u16(&s_parser.body[PROTO_HEADER_SIZE + payload_len]);
        crc_actual = proto_crc16_ccitt_false(s_parser.body,
                                             (uint16_t)(PROTO_HEADER_SIZE + payload_len));
        cmd = proto_get_u16(&s_parser.body[4]);
        seq = s_parser.body[6];
        payload = (payload_len > 0U) ? &s_parser.body[PROTO_HEADER_SIZE] : NULL;

        if (crc_actual != crc_expected) {
            if (!proto_rx_relaxed_crc_ok(cmd, s_parser.body, payload, payload_len)) {
                LOG_WARN(
                    "proto: rx crc fail len=%u exp=0x%04x got=0x%04x "
                    "cmd=0x%04x seq=%u body=%02x%02x%02x%02x%02x%02x%02x%02x",
                    (unsigned)payload_len,
                    (unsigned)crc_expected,
                    (unsigned)crc_actual,
                    (unsigned)cmd,
                    (unsigned)seq,
                    s_parser.body[0],
                    s_parser.body[1],
                    s_parser.body[2],
                    s_parser.body[3],
                    s_parser.body[4],
                    s_parser.body[5],
                    s_parser.body[6],
                    s_parser.body[7]);
                proto_parse_reset();
                break;
            }
            LOG_WARN(
                "proto: rx crc relaxed accept cmd=0x%04x seq=%u (wire=0x%04x body=0x%04x)",
                (unsigned)cmd,
                (unsigned)seq,
                (unsigned)crc_expected,
                (unsigned)crc_actual);
        }

        if (s_parser.body[1] & PROTO_FLAG_DIR_DEVICE) {
            proto_parse_reset();
            break;
        }

        /* DRIVE/STOP 高频：勿刷 INFO，否则 UART7 阻塞会拖垮遥控时序 */
        if ((cmd != PROTO_CMD_PING) && (cmd != PROTO_CMD_GET_TELEMETRY) &&
            (cmd != PROTO_CMD_DRIVE) && (cmd != PROTO_CMD_DRIVE_STOP)) {
            LOG_INFO("proto: rx cmd=0x%04x seq=%u len=%u", (unsigned)cmd, (unsigned)seq,
                     (unsigned)payload_len);
        }
        proto_link_note_host_rx();
        proto_dispatch(cmd, seq, payload, payload_len);
        proto_parse_reset();
        break;
    default:
        proto_parse_reset();
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* RX 任务                                                                    */
/* -------------------------------------------------------------------------- */

static void proto_rx_task(void *arg)
{
    static bool s_stack_logged;

    (void)arg;

    for (;;) {
        if (!s_stack_logged) {
            s_stack_logged = true;
            LOG_INFO("proto: stack hw proto_rx=%u words",
                     (unsigned)uxTaskGetStackHighWaterMark(NULL));
        }

        if (s_link_recover_req != FALSE) {
            const char *reason = s_link_recover_reason;

            s_link_recover_req = FALSE;
            s_link_recover_reason = NULL;
            proto_link_recover_do(reason);
            if (s_reconnect_attempts < 0xFFU) {
                s_reconnect_attempts++;
            }
            s_reconnect_wait_ms = PROTO_RECONNECT_PERIOD_MS;
        }

        char ch;

        while (UART_Getc(&ch) != 0) {
            if (s_echo_mode) {
                UART_Putc(ch);
                continue;
            }
            proto_parse_byte((uint8_t)ch);
        }
        vTaskDelay(pdMS_TO_TICKS(PROTO_RX_POLL_MS));
    }
}

void proto_telemetry_tick(uint32_t period_ms)
{
    if (s_drive_stop_req) {
        proto_motor_all_stop();
        s_drive_stop_req = false;
        s_drive_active = false;
    } else if (s_drive_active) {
        uint32_t now = proto_uptime_ms();

        if ((now - s_drive_last_ms) > PROTO_DRIVE_TIMEOUT_MS) {
            proto_motor_all_stop();
            s_drive_active = false;
            LOG_WARN("proto: drive timeout %ums → stop", (unsigned)PROTO_DRIVE_TIMEOUT_MS);
        } else {
            proto_apply_drive(s_drive_throttle, s_drive_steer);
        }
    }

    /*
     * 链路保活：2Hz 姿态，只避开参数写 suppress，不受 host_rx_active 阻塞。
     * 保证遥控器能持续收到字节，避免 30s link timeout。
     */
    s_keepalive_att_ms += period_ms;
    if (s_keepalive_att_ms >= PROTO_KEEPALIVE_ATT_MS) {
        s_keepalive_att_ms = 0U;
        if (proto_push_blocked() == FALSE) {
            proto_push_attitude();
            s_base.acc_att_ms = 0U;
        }
    }

    if (proto_push_soft_blocked()) {
        return;
    }

    if (s_base.active != FALSE) {
        s_base.acc_att_ms += period_ms;
        if (s_base.acc_att_ms >= proto_period_ms_for(s_base.hz_att, PROTO_DEFAULT_HZ_ATT)) {
            s_base.acc_att_ms = 0U;
            proto_push_attitude();
        }
        s_base.acc_enc_ms += period_ms;
        if (s_base.acc_enc_ms >= proto_period_ms_for(s_base.hz_enc, PROTO_DEFAULT_HZ_ENC)) {
            s_base.acc_enc_ms = 0U;
            proto_push_encoder();
        }
    }

    if ((s_sub.mask & PROTO_CH_BATTERY) != 0U) {
        s_sub.acc_batt_ms += period_ms;
        if (s_sub.acc_batt_ms >= proto_period_ms_for(s_sub.hz_batt, PROTO_DEFAULT_HZ_BATT)) {
            s_sub.acc_batt_ms = 0U;
            proto_push_battery();
        }
    }
    if ((s_sub.mask & PROTO_CH_LINE_ADC) != 0U) {
        s_sub.acc_line_ms += period_ms;
        if (s_sub.acc_line_ms >= proto_period_ms_for(s_sub.hz_line, PROTO_DEFAULT_HZ_LINE)) {
            s_sub.acc_line_ms = 0U;
            proto_push_line_adc();
        }
    }
    if ((s_sub.mask & PROTO_CH_ULTRASONIC) != 0U) {
        s_sub.acc_ultra_ms += period_ms;
        if (s_sub.acc_ultra_ms >= proto_period_ms_for(s_sub.hz_ultra, PROTO_DEFAULT_HZ_ULTRA)) {
            s_sub.acc_ultra_ms = 0U;
            proto_push_ultrasonic();
        }
    }
    if ((s_sub.mask & PROTO_CH_MOTOR_RPM) != 0U) {
        s_sub.acc_motor_rpm_ms += period_ms;
        if (s_sub.acc_motor_rpm_ms >=
            proto_period_ms_for(s_sub.hz_motor_rpm, PROTO_DEFAULT_HZ_MOTOR_RPM)) {
            s_sub.acc_motor_rpm_ms = 0U;
            proto_push_motor_rpm();
        }
    }
    if ((s_sub.mask & PROTO_CH_ANGLE_LOOP) != 0U) {
        s_sub.acc_angle_loop_ms += period_ms;
        if (s_sub.acc_angle_loop_ms >=
            proto_period_ms_for(s_sub.hz_angle_loop, PROTO_DEFAULT_HZ_ANGLE_LOOP)) {
            s_sub.acc_angle_loop_ms = 0U;
            proto_push_angle_loop();
        }
    }
    if ((s_sub.mask & PROTO_CH_DISTANCE_LOOP) != 0U) {
        s_sub.acc_distance_loop_ms += period_ms;
        if (s_sub.acc_distance_loop_ms >=
            proto_period_ms_for(s_sub.hz_distance_loop, PROTO_DEFAULT_HZ_DISTANCE_LOOP)) {
            s_sub.acc_distance_loop_ms = 0U;
            proto_push_distance_loop();
        }
    }
    if ((s_sub.mask & PROTO_CH_LINE_LOOP) != 0U) {
        s_sub.acc_line_loop_ms += period_ms;
        if (s_sub.acc_line_loop_ms >=
            proto_period_ms_for(s_sub.hz_line_loop, PROTO_DEFAULT_HZ_LINE_LOOP)) {
            s_sub.acc_line_loop_ms = 0U;
            proto_push_line_loop();
        }
    }
    if ((s_sub.mask & PROTO_CH_CAM_DETECT) != 0U) {
        s_sub.acc_cam_detect_ms += period_ms;
        if (s_sub.acc_cam_detect_ms >=
            proto_period_ms_for(s_sub.hz_cam_detect, PROTO_DEFAULT_HZ_CAM_DETECT)) {
            s_sub.acc_cam_detect_ms = 0U;
            proto_push_cam_detect();
        }
    }
    if ((s_sub.mask & PROTO_CH_CAM_SERVO) != 0U) {
        s_sub.acc_cam_servo_ms += period_ms;
        if (s_sub.acc_cam_servo_ms >=
            proto_period_ms_for(s_sub.hz_cam_servo, PROTO_DEFAULT_HZ_CAM_SERVO)) {
            s_sub.acc_cam_servo_ms = 0U;
            proto_push_cam_servo();
        }
    }
}

status_t proto_uart_service_start(void)
{
    if (s_rx_task != NULL) {
        return STATUS_OK;
    }

    if (s_tx_mutex == NULL) {
        s_tx_mutex = xSemaphoreCreateMutex();
        if (s_tx_mutex == NULL) {
            return STATUS_NO_MEM;
        }
    }

    if (s_tx_queue == NULL) {
        s_tx_queue = xQueueCreate(PROTO_TX_QUEUE_LEN, sizeof(proto_tx_item_t));
        if (s_tx_queue == NULL) {
            return STATUS_NO_MEM;
        }
    }

    if (s_tx_task == NULL) {
        if (xTaskCreate(proto_tx_task, PROTO_TASK_NAME_TX, PROTO_TX_STACK_WORDS, NULL,
                        PROTO_TX_PRIORITY, &s_tx_task) != pdPASS) {
            LOG_ERROR("proto: create tx task failed");
            vQueueDelete(s_tx_queue);
            s_tx_queue = NULL;
            vSemaphoreDelete(s_tx_mutex);
            s_tx_mutex = NULL;
            return STATUS_FAIL;
        }
    }

    proto_parse_reset();
    (void)memset(&s_base, 0, sizeof(s_base));
    (void)memset(&s_sub, 0, sizeof(s_sub));
    s_base.active = TRUE;
    s_base.hz_att = PROTO_DEFAULT_HZ_ATT;
    s_base.hz_enc = PROTO_DEFAULT_HZ_ENC;
    s_sub.hz_line = PROTO_DEFAULT_HZ_LINE;
    s_sub.hz_ultra = PROTO_DEFAULT_HZ_ULTRA;
    s_sub.hz_motor_rpm = PROTO_DEFAULT_HZ_MOTOR_RPM;
    s_sub.hz_angle_loop = PROTO_DEFAULT_HZ_ANGLE_LOOP;
    s_sub.hz_distance_loop = PROTO_DEFAULT_HZ_DISTANCE_LOOP;
    s_sub.hz_line_loop = PROTO_DEFAULT_HZ_LINE_LOOP;
    s_sub.hz_cam_detect = PROTO_DEFAULT_HZ_CAM_DETECT;
    s_sub.hz_cam_servo = PROTO_DEFAULT_HZ_CAM_SERVO;
    s_sub.hz_batt = PROTO_DEFAULT_HZ_BATT;
    s_ultra_ready = FALSE;
    s_ultra_init_attempted = FALSE;

    if (xTaskCreate(proto_rx_task, PROTO_TASK_NAME_RX, PROTO_RX_STACK_WORDS, NULL,
                    PROTO_RX_PRIORITY, &s_rx_task) != pdPASS) {
        LOG_ERROR("proto: create rx task failed");
        vTaskDelete(s_tx_task);
        s_tx_task = NULL;
        vQueueDelete(s_tx_queue);
        s_tx_queue = NULL;
        vSemaphoreDelete(s_tx_mutex);
        s_tx_mutex = NULL;
        s_rx_task = NULL;
        return STATUS_FAIL;
    }

    LOG_INFO("proto: uart0 service ready");
    /* 上电后主动宣告，便于遥控器在未复位小车时也能建链 */
    s_host_linked = FALSE;
    s_last_host_rx_ms = 0U;
    s_reconnect_attempts = 0U;
    s_reconnect_wait_ms = 0U;
    s_link_recover_req = TRUE;
    s_link_recover_reason = "boot";
    return STATUS_OK;
}

bool_t proto_host_is_linked(void)
{
    return s_host_linked;
}

void proto_link_force_reconnect(void)
{
    s_host_linked = FALSE;
    s_last_host_rx_ms = 0U;
    s_reconnect_attempts = 0U;
    s_reconnect_wait_ms = 0U;
    s_reconnect_budget_logged = FALSE;
    s_link_recover_req = TRUE;
    s_link_recover_reason = "button";
    LOG_INFO("proto: force reconnect (button), auto budget=%u",
             (unsigned)PROTO_RECONNECT_MAX);
}

void proto_link_tick(uint32_t period_ms)
{
    uint32_t now;
    uint32_t silent_ms;

    if (s_rx_task == NULL) {
        return;
    }

    now = proto_uptime_ms();

    if (s_host_linked != FALSE) {
        if (s_last_host_rx_ms == 0U) {
            return;
        }
        silent_ms = now - s_last_host_rx_ms;
        if (silent_ms < PROTO_LINK_LOST_MS) {
            return;
        }
        s_host_linked = FALSE;
        LOG_WARN("proto: host link LOST (silent %lums)", (unsigned long)silent_ms);
        s_reconnect_attempts = 0U;
        s_reconnect_wait_ms = 0U;
    }

    if (s_reconnect_attempts >= PROTO_RECONNECT_MAX) {
        if (s_reconnect_budget_logged == FALSE) {
            s_reconnect_budget_logged = TRUE;
            LOG_WARN("proto: reconnect budget exhausted; press OK to retry");
        }
        return;
    }

    if (s_link_recover_req != FALSE) {
        return;
    }

    if (s_reconnect_wait_ms < period_ms) {
        s_reconnect_wait_ms = 0U;
    } else {
        s_reconnect_wait_ms -= period_ms;
    }

    if (s_reconnect_wait_ms == 0U) {
        s_link_recover_req = TRUE;
        s_link_recover_reason = "auto";
        s_reconnect_wait_ms = PROTO_RECONNECT_PERIOD_MS;
    }
}

void proto_echo_set(bool_t enable)
{
    s_echo_mode = enable;
    if (enable) {
        proto_parse_reset();
    }
    LOG_INFO("proto: echo %s", enable ? "on" : "off");
}

bool_t proto_echo_get(void)
{
    return s_echo_mode;
}

void proto_send_raw(const uint8_t *data, uint16_t len)
{
    if ((data == NULL) || (len == 0U)) {
        return;
    }
    (void)proto_enqueue_frame_bytes(data, len, FALSE);
}
